# 対応する極意発動でTrue
def judgeSecret(i:int, l:list):
    flag = True
    if i == 8: # 火事場
        flag &= ((int(l[184][1]) >= int(l[184][3])) | # 金獅子の闘志+4
                 (int(l[189][1]) >= int(l[189][2])))  # 黒龍の伝説+2
    elif i == 18: # KO
        flag &= ((int(l[132][1]) >= int(l[132][2])) | # 角竜の覇気+3
                 (int(l[188][1]) >= int(l[188][3])) | # 氷牙竜の絶技+3
                 (int(l[189][1]) >= int(l[189][2])))  # 黒龍の伝説+2
    elif i == 25: # 渾身
        flag &= ((int(l[163][1]) >= int(l[163][2])) | # 斬竜の真髄+3
                 (int(l[184][1]) >= int(l[184][2])) | # 金獅子の闘志+2
                 (int(l[189][1]) >= int(l[189][2])))  # 黒龍の伝説+2
    elif i == 44: # スタミナ奪取
        flag &= ((int(l[167][1]) >= int(l[167][2])) | # 恐暴竜の真髄+3
                 (int(l[189][1]) >= int(l[189][2])))  # 黒龍の伝説+2
    elif i == 45: # スリンガー装填数
        flag &= ((int(l[174][1]) >= int(l[174][2])) | # 銀火竜の真髄+2
                 (int(l[189][1]) >= int(l[189][2])))  # 黒龍の伝説+2
    elif i == 46: # 整備
        flag &= ((int(l[155][1]) >= int(l[155][2])) | # 炎妃龍の真髄+3
                 (int(l[189][1]) >= int(l[189][2])))  # 黒龍の伝説+2
    elif i == 47: # 精霊の加護
        flag &= ((int(l[173][1]) >= int(l[173][2])) | # 金火竜の真髄+2
                 (int(l[189][1]) >= int(l[189][2])))  # 黒龍の伝説+2
    elif i == 58: # 力の解放
        flag &= ((int(l[168][1]) >= int(l[168][2])) | # 雷狼竜の真髄+3
                 (int(l[189][1]) >= int(l[189][2])))  # 黒龍の伝説+2
    elif i == 63: #挑戦者
        flag &= ((int(l[164][1]) >= int(l[164][2])) | # 砕竜の真髄+3
                 (int(l[176][1]) >= int(l[176][3])) | # サバイバー+4
                 (int(l[185][1]) >= int(l[185][2])) | # 砕竜の闘志+2
                 (int(l[189][1]) >= int(l[189][2])))  # 黒龍の伝説+2
    elif i == 96: # 砲術
        flag &= ((int(l[123][1]) >= int(l[123][2])) | # 熔山龍の真髄+3
                 (int(l[185][1]) >= int(l[185][3])) | # 砕竜の闘志+4
                 (int(l[189][1]) >= int(l[189][2])))  # 黒龍の伝説+2
    elif i == 98: # ボマー
        flag &= ((int(l[160][1]) >= int(l[160][2])) | # 調査団の錬金術+3
                 (int(l[189][1]) >= int(l[189][2])))  # 黒龍の伝説+2
    elif i == 102: # 満足感
        flag &= ((int(l[165][1]) >= int(l[165][2])) | # 轟竜の真髄+3
                 (int(l[186][1]) >= int(l[186][3])) | # 爛輝龍の真髄+4
                 (int(l[189][1]) >= int(l[189][2])))  # 黒龍の伝説+2
    return flag